---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.GetCutPairOpenings
source: html/d4f0caa2-a21a-18e1-325c-67b026e9790b.htm
---
# Autodesk.Revit.DB.IFC.IFCFamilyInstanceExtrusionExportResults.GetCutPairOpenings Method

Gets the set of "openings" determined from the analysis of the instance geometry.

## Syntax (C#)
```csharp
public IList<IFCExtrusionData> GetCutPairOpenings()
```

## Returns
The extra openings.